Repository: S-Cesc/flutter_projecte_cifo
Catalog: mypills/lib/l10n/app_*.arb
Languages: ca, es

# appTitle
source: My Pills
ca: Meues Pastis
es: Mis Pastis

# notificationTitle
source: Take the pills!
ca: Pren-te les pastilles!
es: Tómate las pastillas!

# notificationText1
source: You have to take the pills.
ca: T'has de prendre les pastilles.
es: Te has de tomar las pastillas.

# notificationText2
source: Please tap to open the app
ca: Si us plau, toca per a obrir l'app
es: Por favor, toque para abrir la app

source: Initializing...
ca: Iniciant...
es: Iniciando...

source: Loading parameters...
ca: Carregant paràmetres...
es: Cargando parámetros...

source: Setting configuration...
ca: Establint la configuració...
es: Estableciendo la configuración...

# requiredPermissions
source: Checking the required permissions...
ca: Verificant els permissos necessaris...
es: Verificando los permisos necesarios...

source: Initializing services...
ca: Iniciant serveis...
es: Iniciando servicios...

# failedPermissions
source: Required permissions have not been granted
ca: No heu concedit els permissos necessaris
es: No se han concedido los permisos necesarios

# informationLoaded
source: Ready!
ca: Preparat!
es: Listo!

source: Yes
ca: Sí
es: Sí

# saveChanges
source: Save
ca: Desa
es: Salvar

# undoChanges
source: Undo
ca: Desfés
es: Deshacer

source: Cancel
ca: Cancel·la
es: Cancelar

source: Discard
ca: Descarta
es: Descartar

source: Saved
ca: S'ha desat
es: Datos guardados

# added
source: Item added
ca: S'ha afegit l'element
es: Elemento agregado

source: Pending changes
ca: Canvis pendents
es: Cambios pendientes

# pendingChangesMessage
source: There are pending changes.
ca: N'hi ha canvis pendents.
es: Hay cambios pendientes.

# pendingChangesDiscardQuestion
source: Discard the pending changes?
ca: Voleu descartar els canvis pendents?
es: ¿Quiere descartar los cambios pendientes?

# pendingChangesDiscarded
source: Pending changes have been discarded.
ca: S'han descartat els canvis pendents.
es: Se han descartado los cambios pendientes.

# notSavedCauseOfError
source: Error. Not saved
ca: Error; no s'ha desat
es: Error. No se ha salvado

# notAddedExisting
source: Not added: it already exists
ca: No s'ha afegit: ja existeix
es: No se ha agregado: ya existía

source: Confirm
ca: Confirmeu
es: Confirmar

# confirmDeletion
source: {count, plural, other{ {gender, select, other{Would you like to remove?}}}}
ca: Segur que {count, plural, =1{{gender, select, f{la} other {el}}} other{{gender, select, f{les} other {els}} ($count)}} voleu eliminar?
es: ¿Seguro que quiere eliminar{count, plural, =1{{gender, select, f{la} other {lo}}} other{{gender, select, f{las} other {los}}}}?

# exitApplication
source: Exit
ca: Sortir
es: Salir

# restartApplication
source: Restart
ca: Reinicia
es: Reinicia

# changeAlarmPermissions
source: Change alarm permission configuration
ca: Canviar la configuració de permisos d'alarma
es: Cambiar la configuración de permisos de alarma

# askExitApplication
source: Exit application?
ca: Sortir de l'aplicació?
es: ¿Salir de la aplicación?

# emptyDaysetError
source: Meals cannot be defined if it is not indicated for which days.
ca: No poden definir-se menjades si no s'indica per a quins dies.
es: No pueden definirse comidas si no se indica para qué días.

# timeTableModifiedWarning
source: Times have been modified to maintain consistency.
ca: S'han modificat les hores per mantenir la coherència.
es: Se han modificado las horas para mantener la coherencia.

source: Snooze
ca: Retarda
es: Retardar

source: Missed alarm
ca: Alarma perduda
es: Alarma perdida

# stoppedAlarm
source: Alarm stopped
ca: Alarma detinguda
es: Alarma detenida

# snoozedAlarm
source: Alarm snoozed
ca: Alarma retardada
es: Alarma retrasada

source: Once
ca: Una vegada
es: Una vez

# onceADay
source: Once a day (24h)
ca: Una vegada al dia (24h)
es: Una vez al día (24h)

# twiceADay
source: Twice a day (12h)
ca: Dues vegades al dia (12h)
es: Dos veces al día (12h)

# threeTimesADay
source: Three times a day (8h)
ca: Tres vegades al dia (8h)
es: Tres veces al día (8h)

# fourTimesADay
source: Four times a day (6h)
ca: Quatre vegades al dia (6h)
es: Cuatro veces al día (6h)

# weekly
source: Once a week
ca: Una vegada a la setmana
es: Una vez a la semana

source: Every two weeks
ca: Cada dues setmanes
es: Cada dos semanas

# fortnightly
source: Every fortnight (twice each month)
ca: Cada quinze dies (dues vegades al mes)
es: Cada quince días (dos veces al mes)

source: Every four weeks
ca: Cada quatre setmanes
es: Cada cuatro semanas

# monthly
source: Once a month
ca: Una vegada al mes
es: Una vez al mes

# once_tooltip
source: Take the pills once, just once.
ca: Prendre les pastilles una vegada, només una vegada.
es: Tomar las pastillas una vez, sólo una vez.

# onceADay_tooltip
source: Take the pills daily, every 24h.
ca: Prendre les pastilles diàriament, cada 24h.
es: Tomar las pastillas diariamente, cada 24h.

# twiceADay_tooltip
source: Take the pills twice a day, every 12h.
ca: Prendre les pastilles dues vegades al dia, cada 12h.
es: Tomar las pastillas dos veces al día, cada 12h.

# threeTimesADay_tooltip
source: Take the pills three times a day, every 8h.
ca: Prendre les pastilles tres vegades al dia, cada 8h.
es: Tomar las pastillas tres veces al día, cada 8h.

# fourTimesADay_tooltip
source: Take the pills four times a day, every 6h.
ca: Prendre les pastilles quatre vegades al dia, cada 6h.
es: Tomar las pastillas cuatro veces al día, cada 6h.

# weekly_tooltip
source: Take the pills weekly, once a week, always the same day of week.
ca: Prendre les pastilles setmanalment, una vegada a la setmana, sempre el mateix dia de la setmana.
es: Tomar las pastillas semanalmente, una vez a la semana, siempre el mismo día de la semana.

# everyTwoWeeks_tooltip
source: Take the pills every two weeks, always the same day of week.
ca: Prendre les pastilles cada dues setmanes, sempre el mateix dia de la setmana.
es: Tomar las pastillas cada dos semanas, siempre el mismo día de la semana.

# fortnightly_tooltip
source: Take pills every fortnight, twice each month, always the same day of month.
ca: Prendre pastilles cada quinze dies, dues vegades al mes, sempre el mateix dia del mes.
es: Tomar pastillas cada quince días, dos veces al mes, siempre el mismo día del mes.

# everyFourWeeks_tooltip
source: Take pills every four weeks, always the same day of week.
ca: Prendre les pastilles cada quatre setmanes, sempre el mateix dia de la setmana.
es: Tomar las pastillas cada cuatro semanas, siempre el mismo día de la semana.

# monthly_tooltip
source: Take pills once a month, always the same day of month.
ca: Prendre les pastilles una vegada al mes, sempre el mateix dia del mes.
es: Tomar las pastillas una vez al mes, siempre el mismo día del mes.

source: Alarm settings
ca: Configuració d'alarmes
es: Configuración de las alarmas

# alarmRepeatTimes
source: Repeat times
ca: Repeticions
es: Repeticiones

# alarmDurationSeconds
source: Duration seconds
ca: Durada en segons
es: Duración en segundos

# alarmSnoozeSeconds
source: Snooze time in seconds
ca: Segons fins a la repetició
es: Segundos hasta la repetición

source: Minutes to deal with alarm
ca: Minuts per a atendre l'alarma
es: Minutos para atender la alarma

# tooltipAlarmRepeatTimes
source: Number of times the alarm sounds until it is given up as lost
ca: Nombre de vegades que sona l'alarma fins que es considera perduda
es: Número veces que suena la alarma hasta que se da por perdida

# tooltipSnoozeSeconds
source: Seconds from the end of the alarm sounding without stopping it until it automatically repeats itself
ca: Segons des de que acaba de sonar l'alarma sense haver-la aturat fins que es repeteix automàticament
es: Segundos desde que termina de sonar la alarma sin haberla detenido hasta que se repite automáticamente

# tooltipAlarmDurationSeconds
source: Seconds the alarm sounds if not stopped
ca: Segons que l'alarma està sonant si no s'atura
es: Segundos que suena la alarma si no se detiene

# tooltipMinutesToDealWithAlarm
source: Maximum number of minutes from the time the alarm is acknowledged until the pills are taken
ca: Minuts que transcorren com a màxim des de que s'accepta l'alarma fins a indicar que s'han pres les pastilles
es: Minutos que como máximo transcurren desde que se acepta la alarma hasta indicar que se han tomado las pastillas

# timeSettings
source: Before/after minutes
ca: Minuts abans/després
es: Minutos antes/después

# minutesLongBefore
source: Minutes long before meal
ca: Minuts molt abans
es: Minutos mucho antes

# minutesBefore
source: Minutes before meal
ca: Minuts abans
es: Minutos antes

# minutesAfter
source: Minutes after meal
ca: Minuts després
es: Minutos después

# minutesLongAfter
source: Minutes long after supper
ca: Minuts molt després
es: Minutos mucho después

# tooltipLongBefore
source: Minutes from taking the pills between meals until eating. Combined with the value indicated for long after the previous meal. Applies if you take pills between meals.
ca: Minuts d'ençà que es prenen les pastilles entre menjades fins a menjar. Es combina amb el valor indicat per a molt després de l'anterior menjada. Aplica si prens pastilles entre menjades.
es: Minutos desde que se toman las pastillas entre comidas hasta comer. Se combina con el valor indicado para mucho después de la anterior comida. Aplica si toma pastillas entre comidas.

# tooltipBefore
source: Minutes before meals you are notified to take the pills before meals. Applies if you take pills before meals.
ca: Minuts abans dels menjars que avisa per a prendre pastilles abans dels menjars. Aplica si prens pastilles abans dels menjars.
es: Minutos antes de las comidas que se le notifica para tomar las pastillas antes de las comidas. Aplica si toma pastillas antes de las comidas.

# tooltipAfter
source: Minutes in addition to the time used for eating. Applies if you take pills after meals.
ca: Minuts que se sumen al temps per a menjar. Aplica si prens pastilles després dels menjars.
es: Minutos que se suman al tiempo usado para comer. Aplica si toma pastillas después de las comidas.

# tooltipLongAfter
source: Minutes that need to pass after meals to take pills between meals. Applies if you take pills between meals.
ca: Minuts que han de passar després dels menjars per a prendre pastilles entre menjades. Aplica si prens pastilles entre menjades.
es: Minutos que tienen que pasar después de las comidas para tomar las pastillas entre comidas. Aplica si toma pastillas entre comidas.

# timeEating
source: Time spent eating
ca: Temps per a menjar
es: Tiempo para comer

# timeEatingTooltip
source: Time you spend on each meal. You only have to set values for those meals you have. A distinction is made between 'fast' and 'slow' values.
ca: Temps que dediques a cada menjar. Només has d'establir valors per als menjars que realitzes. Es diferencien valors «ràpids» i «lents».
es: Tiempo que dedica a cada comida. Sólo tiene que establecer valores para las comidas que realiza. Se diferencian valores «rápidos» y «lentos».

# bkfDuration
source: Breakfast duration, in minutes.
ca: Durada del desdejuni, en minuts.
es: Duración del desayuno, en minutos.

# elevensesDuration
source: Elevenses duration, in minutes.
ca: Durada del cafè de mig matí, en minuts.
es: Duración del café de media mañana, en minutos.

# brunchDuration
source: Brunch duration, in minutes.
ca: Durada de l'esmorzar, en minuts.
es: Duración del almuerzo, en minutos.

# lunchDuration
source: Lunch duration, in minutes.
ca: Durada del dinar, en minuts.
es: Duración de la comida, en minutos.

# teaDuration
source: Afternoon tea duration, in minutes.
ca: Durada del cafè, en minuts.
es: Duración del café, en minutos.

# highTeaDuration
source: Tea duration, in minutes.
ca: Durada del berenar, en minuts.
es: Duración de la merienda, en minutos.

# dinnerDuration
source: Dinner duration, in minutes.
ca: Durada del sopar, en minuts.
es: Duración de la cena, en minutos.

# supperDuration
source: Supper duration, in minutes.
ca: Durada del ressopó, en minuts.
es: Duración del resopón, en minutos.

source: Meal
ca: Menjar
es: Comida

source: breakfast
ca: desdejuni
es: desayuno

source: elevenses
ca: cafè de mig matí
es: café de media mañana

source: brunch
ca: esmorzar
es: almuerzo

source: lunch
ca: dinar
es: comida

# tea
source: afternoon tea
ca: cafè
es: café

# highTea
source: tea
ca: berenar
es: merienda

source: dinner
ca: sopar
es: cena

source: supper
ca: ressopó
es: resopón

source: long before
ca: molt abans
es: mucho antes

source: before
ca: abans
es: antes

source: at
ca: durant
es: durante

source: after
ca: després
es: después

source: long after
ca: molt després
es: mucho después

# slowLabel
source: Slow
ca: Lent
es: Lento

# fastLabel
source: Fast
ca: Ràpid
es: Rápido

# weeklyTimetable
source: Weekly routine
ca: Rutina setmanal
es: Rutina semanal

# defaultWeeklyTimetable
source: Meals you usually have and at what time
ca: Menjars que feu habitualment i a quina hora
es: Comidas que realiza habitualmente y a qué hora

# specialWeeklyTimetable
source: Meals and its time on designated days
ca: Menjars i hora en els dies determinats
es: Comidas y su hora en los días determinados

# configMealsTooltip
source: Meals should be defined for each day, so that the system can know the time intervals between meals. In addition, three other alternative routines can be defined for specific days of the week.
ca: Han de definir-se els menjars de cada dia, perquè el sistema pugui conèixer els intervals de temps entre menjars. A més, opcionalment, es poden definir fins a altres tres rutines alternatives per a dies concrets de la setmana.
es: Deben definirse las comidas de cada día, para que el sistema pueda conocer los intervalos de tiempo entre comidas. Además, opcionalmente, se pueden definir hasta otras tres rutinas alternativas para días concretos de la semana.

source: Meals for pills
ca: Menjades per a pastilles
es: Comidas para pastillas

source: Alarm list
ca: Llista d'alarmes
es: Lista de alarmas

source: Alarms
ca: Alarmes
es: Alarmas

source: Create new alarm
ca: Crear nova alarma
es: Crear nueva alarma

# pillsLongBeforeBreakfast
source: morning pills
ca: pastilles del matí
es: pastillas de la mañana

# pillsBeforeBreakfast
source: pre-breakfast pills
ca: pastilles d'abans del desdejuni
es: pastillas de antes de desayunar

# pillsAtBreakfast
source: breakfast pills
ca: pastilles del desdejuni
es: pastillas del desayuno

# pillsAfterBreakfast
source: after-breakfast pills
ca: pastilles de després del desdejuni
es: pastillas de después del desayuno

# pillsLongBeforeElevenses
source: pills well before elevenses
ca: pastilles de molt abans del cafè de mig matí
es: pastillas de mucho antes del café de media mañana

# pillsBeforeElevenses
source: pre-elevenses pills
ca: pastilles d'abans del cafè de mig matí
es: pastillas de antes del café de media mañana

# pillsAtElevenses
source: elevenses pills
ca: pastilles del cafè de mig matí
es: pastillas del café de media mañana

# pillsAfterElevenses
source: after-elevenses pills
ca: pastilles després del cafè de mig matí
es: pastillas després del café de media mañana

# pillsLongBeforeBrunch
source: pills well before brunch
ca: pastilles de molt abans d'esmorzar
es: pastillas de mucho antes del almuerzo

# pillsBeforeBrunch
source: pre-brunch pills
ca: pastilles d'abans d'esmorzar
es: pastillas de antes del almuerzo

# pillsAtBrunch
source: brunch pills
ca: pastilles de l'esmorzar
es: pastillas del almuerzo

# pillsAfterBrunch
source: after-brunch pills
ca: pastilles de després d'esmorzar
es: pastillas de después del almuerzo

# pillsLongBeforeLunch
source: pills well before lunch
ca: pastilles de molt abans de dinar
es: pastillas de mucho antes de la comida

# pillsBeforeLunch
source: pre-lunch pills
ca: pastilles d'abans de dinar
es: pastillas de antes de la comida

# pillsAtLunch
source: lunch pills
ca: pastilles de dinar
es: pastillas de la comida

# pillsAfterLunch
source: after-lunch pills
ca: pastilles de després dinar
es: pastillas de después la comida

# pillsLongBeforeTea
source: pills well before afternoon tea
ca: pastilles de molt abans de l'hora del cafè
es: pastillas de mucho antes de la hora del café

# pillsBeforeTea
source: pills before afternoon tea
ca: pastilles d'abans de l'hora del cafè
es: pastillas de antes de la hora del café

# pillsAtTea
source: afternoon tea pills
ca: pastilles de l'hora del cafè
es: pastillas de la hora del café

# pillsAfterTea
source: after-afternoon tea pills
ca: pastilles de després de l'hora del cafè
es: pastillas de después de la hora del café

# pillsLongBeforeHighTea
source: pills well before tea
ca: pastilles de molt abans de berenar
es: pastillas de mucho antes de merendar

# pillsBeforeHighTea
source: pills before tea
ca: pastilles d'abans de berenar
es: pastillas de antes de merendar

# pillsAtHighTea
source: tea pills
ca: pastilles del berenar
es: pastillas de merendar

# pillsAfterHighTea
source: after-tea pills
ca: pastilles de després de berenar
es: pastillas de después de merendar

# pillsLongBeforeDinner
source: pills well before dinner
ca: pastilles de molt abans de sopar
es: pastillas de mucho antes de cenar

# pillsBeforeDinner
source: pre-dinner pills
ca: pastilles d'abans de sopar
es: pastillas de antes de cenar

# pillsAtDinner
source: dinner pills
ca: pastilles de sopar
es: pastillas de cenar

# pillsAfterDinner
source: after-dinner pills
ca: pastilles de després de sopar
es: pastillas de después de cenar

# pillsLongBeforeSupper
source: pills well before supper
ca: pastilles de molt abans del ressopó
es: pastillas de mucho antes del resopón

# pillsBeforeSupper
source: pre-supper pills
ca: pastilles d'abans del ressopó
es: pastillas de antes del resopón

# pillsAtSupper
source: supper pills
ca: pastilles del ressopó
es: pastillas del resopón

# pillsAfterSupper
source: after-supper pills
ca: pastilles de després del ressopó
es: pastillas de después del resopón

# pillsLongAfterSupper
source: midnight pills
ca: pastilles de la nit
es: pastillas de la noche
